name: "arcface"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: { dim: 1 dim: 3 dim: 108 dim: 108 }
  }
}

layer {
	bottom: "data"
	top: "part_0_conv0"
	name: "part_0_conv0"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
	param {
	  name: "data"
	}
}

layer {
  bottom: "part_0_conv0"
  top: "part_0_bn0"
  name: "part_0_bn0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_bn0"
  top: "part_0_bn0"
  name: "part_0_bn0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_bn0"
  top: "part_0_relu0"
  name: "part_0_relu0"
  type: "ReLU"
}

layer {
  bottom: "part_0_relu0"
  top: "pooling0"
  name: "pooling0"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}

layer {
	bottom: "pooling0"
	top: "part_0_stage1_unit1_conv1"
	name: "part_0_stage1_unit1_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage1_unit1_conv1"
  top: "part_0_stage1_unit1_bn1"
  name: "part_0_stage1_unit1_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage1_unit1_bn1"
  top: "part_0_stage1_unit1_bn1"
  name: "part_0_stage1_unit1_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage1_unit1_bn1"
  top: "part_0_stage1_unit1_relu1"
  name: "part_0_stage1_unit1_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage1_unit1_relu1"
	top: "part_0_stage1_unit1_conv2"
	name: "part_0_stage1_unit1_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage1_unit1_conv2"
  top: "part_0_stage1_unit1_bn2"
  name: "part_0_stage1_unit1_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage1_unit1_bn2"
  top: "part_0_stage1_unit1_bn2"
  name: "part_0_stage1_unit1_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage1_unit1_bn2"
  top: "part_0_stage1_unit1_relu2"
  name: "part_0_stage1_unit1_relu2"
  type: "ReLU"
}

layer {
	bottom: "pooling0"
	top: "part_0_stage1_unit1_conv_proj"
	name: "part_0_stage1_unit1_conv_proj"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage1_unit1_conv_proj"
  top: "part_0_stage1_unit1_bn_proj"
  name: "part_0_stage1_unit1_bn_proj"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage1_unit1_bn_proj"
  top: "part_0_stage1_unit1_bn_proj"
  name: "part_0_stage1_unit1_bn_proj_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage1_unit1_bn_proj"
  top: "part_0_stage1_unit1_relu_proj"
  name: "part_0_stage1_unit1_relu_proj"
  type: "ReLU"
}

layer {
  name: "_plus0"
  type: "Eltwise"
  bottom: "part_0_stage1_unit1_relu2"
  bottom: "part_0_stage1_unit1_relu_proj"
  top: "_plus0"
}

layer {
	bottom: "_plus0"
	top: "part_0_stage1_unit2_conv1"
	name: "part_0_stage1_unit2_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage1_unit2_conv1"
  top: "part_0_stage1_unit2_bn1"
  name: "part_0_stage1_unit2_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage1_unit2_bn1"
  top: "part_0_stage1_unit2_bn1"
  name: "part_0_stage1_unit2_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage1_unit2_bn1"
  top: "part_0_stage1_unit2_relu1"
  name: "part_0_stage1_unit2_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage1_unit2_relu1"
	top: "part_0_stage1_unit2_conv2"
	name: "part_0_stage1_unit2_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage1_unit2_conv2"
  top: "part_0_stage1_unit2_bn2"
  name: "part_0_stage1_unit2_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage1_unit2_bn2"
  top: "part_0_stage1_unit2_bn2"
  name: "part_0_stage1_unit2_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage1_unit2_bn2"
  top: "part_0_stage1_unit2_relu2"
  name: "part_0_stage1_unit2_relu2"
  type: "ReLU"
}

layer {
  name: "_plus1"
  type: "Eltwise"
  bottom: "part_0_stage1_unit2_relu2"
  bottom: "_plus0"
  top: "_plus1"
}

layer {
	bottom: "_plus1"
	top: "part_0_stage1_unit3_conv1"
	name: "part_0_stage1_unit3_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage1_unit3_conv1"
  top: "part_0_stage1_unit3_bn1"
  name: "part_0_stage1_unit3_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage1_unit3_bn1"
  top: "part_0_stage1_unit3_bn1"
  name: "part_0_stage1_unit3_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage1_unit3_bn1"
  top: "part_0_stage1_unit3_relu1"
  name: "part_0_stage1_unit3_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage1_unit3_relu1"
	top: "part_0_stage1_unit3_conv2"
	name: "part_0_stage1_unit3_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage1_unit3_conv2"
  top: "part_0_stage1_unit3_bn2"
  name: "part_0_stage1_unit3_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage1_unit3_bn2"
  top: "part_0_stage1_unit3_bn2"
  name: "part_0_stage1_unit3_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage1_unit3_bn2"
  top: "part_0_stage1_unit3_relu2"
  name: "part_0_stage1_unit3_relu2"
  type: "ReLU"
}

layer {
  name: "_plus2"
  type: "Eltwise"
  bottom: "part_0_stage1_unit3_relu2"
  bottom: "_plus1"
  top: "_plus2"
}

layer {
	bottom: "_plus2"
	top: "part_0_stage2_unit1_conv1"
	name: "part_0_stage2_unit1_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 2
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage2_unit1_conv1"
  top: "part_0_stage2_unit1_bn1"
  name: "part_0_stage2_unit1_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage2_unit1_bn1"
  top: "part_0_stage2_unit1_bn1"
  name: "part_0_stage2_unit1_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage2_unit1_bn1"
  top: "part_0_stage2_unit1_relu1"
  name: "part_0_stage2_unit1_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage2_unit1_relu1"
	top: "part_0_stage2_unit1_conv2"
	name: "part_0_stage2_unit1_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage2_unit1_conv2"
  top: "part_0_stage2_unit1_bn2"
  name: "part_0_stage2_unit1_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage2_unit1_bn2"
  top: "part_0_stage2_unit1_bn2"
  name: "part_0_stage2_unit1_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage2_unit1_bn2"
  top: "part_0_stage2_unit1_relu2"
  name: "part_0_stage2_unit1_relu2"
  type: "ReLU"
}

layer {
	bottom: "_plus2"
	top: "part_0_stage2_unit1_conv_proj"
	name: "part_0_stage2_unit1_conv_proj"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage2_unit1_conv_proj"
  top: "part_0_stage2_unit1_bn_proj"
  name: "part_0_stage2_unit1_bn_proj"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage2_unit1_bn_proj"
  top: "part_0_stage2_unit1_bn_proj"
  name: "part_0_stage2_unit1_bn_proj_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage2_unit1_bn_proj"
  top: "part_0_stage2_unit1_relu_proj"
  name: "part_0_stage2_unit1_relu_proj"
  type: "ReLU"
}

layer {
  name: "_plus3"
  type: "Eltwise"
  bottom: "part_0_stage2_unit1_relu2"
  bottom: "part_0_stage2_unit1_relu_proj"
  top: "_plus3"
}

layer {
	bottom: "_plus3"
	top: "part_0_stage2_unit2_conv1"
	name: "part_0_stage2_unit2_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage2_unit2_conv1"
  top: "part_0_stage2_unit2_bn1"
  name: "part_0_stage2_unit2_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage2_unit2_bn1"
  top: "part_0_stage2_unit2_bn1"
  name: "part_0_stage2_unit2_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage2_unit2_bn1"
  top: "part_0_stage2_unit2_relu1"
  name: "part_0_stage2_unit2_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage2_unit2_relu1"
	top: "part_0_stage2_unit2_conv2"
	name: "part_0_stage2_unit2_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage2_unit2_conv2"
  top: "part_0_stage2_unit2_bn2"
  name: "part_0_stage2_unit2_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage2_unit2_bn2"
  top: "part_0_stage2_unit2_bn2"
  name: "part_0_stage2_unit2_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage2_unit2_bn2"
  top: "part_0_stage2_unit2_relu2"
  name: "part_0_stage2_unit2_relu2"
  type: "ReLU"
}

layer {
  name: "_plus4"
  type: "Eltwise"
  bottom: "part_0_stage2_unit2_relu2"
  bottom: "_plus3"
  top: "_plus4"
}

layer {
	bottom: "_plus4"
	top: "part_0_stage2_unit3_conv1"
	name: "part_0_stage2_unit3_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage2_unit3_conv1"
  top: "part_0_stage2_unit3_bn1"
  name: "part_0_stage2_unit3_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage2_unit3_bn1"
  top: "part_0_stage2_unit3_bn1"
  name: "part_0_stage2_unit3_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage2_unit3_bn1"
  top: "part_0_stage2_unit3_relu1"
  name: "part_0_stage2_unit3_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage2_unit3_relu1"
	top: "part_0_stage2_unit3_conv2"
	name: "part_0_stage2_unit3_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage2_unit3_conv2"
  top: "part_0_stage2_unit3_bn2"
  name: "part_0_stage2_unit3_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage2_unit3_bn2"
  top: "part_0_stage2_unit3_bn2"
  name: "part_0_stage2_unit3_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage2_unit3_bn2"
  top: "part_0_stage2_unit3_relu2"
  name: "part_0_stage2_unit3_relu2"
  type: "ReLU"
}

layer {
  name: "_plus5"
  type: "Eltwise"
  bottom: "part_0_stage2_unit3_relu2"
  bottom: "_plus4"
  top: "_plus5"
}

layer {
	bottom: "_plus5"
	top: "part_0_stage2_unit4_conv1"
	name: "part_0_stage2_unit4_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage2_unit4_conv1"
  top: "part_0_stage2_unit4_bn1"
  name: "part_0_stage2_unit4_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage2_unit4_bn1"
  top: "part_0_stage2_unit4_bn1"
  name: "part_0_stage2_unit4_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage2_unit4_bn1"
  top: "part_0_stage2_unit4_relu1"
  name: "part_0_stage2_unit4_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage2_unit4_relu1"
	top: "part_0_stage2_unit4_conv2"
	name: "part_0_stage2_unit4_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage2_unit4_conv2"
  top: "part_0_stage2_unit4_bn2"
  name: "part_0_stage2_unit4_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage2_unit4_bn2"
  top: "part_0_stage2_unit4_bn2"
  name: "part_0_stage2_unit4_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage2_unit4_bn2"
  top: "part_0_stage2_unit4_relu2"
  name: "part_0_stage2_unit4_relu2"
  type: "ReLU"
}

layer {
  name: "_plus6"
  type: "Eltwise"
  bottom: "part_0_stage2_unit4_relu2"
  bottom: "_plus5"
  top: "_plus6"
}

layer {
	bottom: "_plus6"
	top: "part_0_stage3_unit1_conv1"
	name: "part_0_stage3_unit1_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 2
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit1_conv1"
  top: "part_0_stage3_unit1_bn1"
  name: "part_0_stage3_unit1_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit1_bn1"
  top: "part_0_stage3_unit1_bn1"
  name: "part_0_stage3_unit1_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit1_bn1"
  top: "part_0_stage3_unit1_relu1"
  name: "part_0_stage3_unit1_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage3_unit1_relu1"
	top: "part_0_stage3_unit1_conv2"
	name: "part_0_stage3_unit1_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit1_conv2"
  top: "part_0_stage3_unit1_bn2"
  name: "part_0_stage3_unit1_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit1_bn2"
  top: "part_0_stage3_unit1_bn2"
  name: "part_0_stage3_unit1_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit1_bn2"
  top: "part_0_stage3_unit1_relu2"
  name: "part_0_stage3_unit1_relu2"
  type: "ReLU"
}

layer {
	bottom: "_plus6"
	top: "part_0_stage3_unit1_conv_proj"
	name: "part_0_stage3_unit1_conv_proj"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit1_conv_proj"
  top: "part_0_stage3_unit1_bn_proj"
  name: "part_0_stage3_unit1_bn_proj"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit1_bn_proj"
  top: "part_0_stage3_unit1_bn_proj"
  name: "part_0_stage3_unit1_bn_proj_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit1_bn_proj"
  top: "part_0_stage3_unit1_relu_proj"
  name: "part_0_stage3_unit1_relu_proj"
  type: "ReLU"
}

layer {
  name: "_plus7"
  type: "Eltwise"
  bottom: "part_0_stage3_unit1_relu2"
  bottom: "part_0_stage3_unit1_relu_proj"
  top: "_plus7"
}

layer {
	bottom: "_plus7"
	top: "part_0_stage3_unit2_conv1"
	name: "part_0_stage3_unit2_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit2_conv1"
  top: "part_0_stage3_unit2_bn1"
  name: "part_0_stage3_unit2_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit2_bn1"
  top: "part_0_stage3_unit2_bn1"
  name: "part_0_stage3_unit2_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit2_bn1"
  top: "part_0_stage3_unit2_relu1"
  name: "part_0_stage3_unit2_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage3_unit2_relu1"
	top: "part_0_stage3_unit2_conv2"
	name: "part_0_stage3_unit2_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit2_conv2"
  top: "part_0_stage3_unit2_bn2"
  name: "part_0_stage3_unit2_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit2_bn2"
  top: "part_0_stage3_unit2_bn2"
  name: "part_0_stage3_unit2_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit2_bn2"
  top: "part_0_stage3_unit2_relu2"
  name: "part_0_stage3_unit2_relu2"
  type: "ReLU"
}

layer {
  name: "_plus8"
  type: "Eltwise"
  bottom: "part_0_stage3_unit2_relu2"
  bottom: "_plus7"
  top: "_plus8"
}

layer {
	bottom: "_plus8"
	top: "part_0_stage3_unit3_conv1"
	name: "part_0_stage3_unit3_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit3_conv1"
  top: "part_0_stage3_unit3_bn1"
  name: "part_0_stage3_unit3_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit3_bn1"
  top: "part_0_stage3_unit3_bn1"
  name: "part_0_stage3_unit3_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit3_bn1"
  top: "part_0_stage3_unit3_relu1"
  name: "part_0_stage3_unit3_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage3_unit3_relu1"
	top: "part_0_stage3_unit3_conv2"
	name: "part_0_stage3_unit3_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit3_conv2"
  top: "part_0_stage3_unit3_bn2"
  name: "part_0_stage3_unit3_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit3_bn2"
  top: "part_0_stage3_unit3_bn2"
  name: "part_0_stage3_unit3_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit3_bn2"
  top: "part_0_stage3_unit3_relu2"
  name: "part_0_stage3_unit3_relu2"
  type: "ReLU"
}

layer {
  name: "_plus9"
  type: "Eltwise"
  bottom: "part_0_stage3_unit3_relu2"
  bottom: "_plus8"
  top: "_plus9"
}

layer {
	bottom: "_plus9"
	top: "part_0_stage3_unit4_conv1"
	name: "part_0_stage3_unit4_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit4_conv1"
  top: "part_0_stage3_unit4_bn1"
  name: "part_0_stage3_unit4_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit4_bn1"
  top: "part_0_stage3_unit4_bn1"
  name: "part_0_stage3_unit4_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit4_bn1"
  top: "part_0_stage3_unit4_relu1"
  name: "part_0_stage3_unit4_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage3_unit4_relu1"
	top: "part_0_stage3_unit4_conv2"
	name: "part_0_stage3_unit4_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit4_conv2"
  top: "part_0_stage3_unit4_bn2"
  name: "part_0_stage3_unit4_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit4_bn2"
  top: "part_0_stage3_unit4_bn2"
  name: "part_0_stage3_unit4_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit4_bn2"
  top: "part_0_stage3_unit4_relu2"
  name: "part_0_stage3_unit4_relu2"
  type: "ReLU"
}

layer {
  name: "_plus10"
  type: "Eltwise"
  bottom: "part_0_stage3_unit4_relu2"
  bottom: "_plus9"
  top: "_plus10"
}

layer {
	bottom: "_plus10"
	top: "part_0_stage3_unit5_conv1"
	name: "part_0_stage3_unit5_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit5_conv1"
  top: "part_0_stage3_unit5_bn1"
  name: "part_0_stage3_unit5_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit5_bn1"
  top: "part_0_stage3_unit5_bn1"
  name: "part_0_stage3_unit5_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit5_bn1"
  top: "part_0_stage3_unit5_relu1"
  name: "part_0_stage3_unit5_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage3_unit5_relu1"
	top: "part_0_stage3_unit5_conv2"
	name: "part_0_stage3_unit5_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit5_conv2"
  top: "part_0_stage3_unit5_bn2"
  name: "part_0_stage3_unit5_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit5_bn2"
  top: "part_0_stage3_unit5_bn2"
  name: "part_0_stage3_unit5_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit5_bn2"
  top: "part_0_stage3_unit5_relu2"
  name: "part_0_stage3_unit5_relu2"
  type: "ReLU"
}

layer {
  name: "_plus11"
  type: "Eltwise"
  bottom: "part_0_stage3_unit5_relu2"
  bottom: "_plus10"
  top: "_plus11"
}

layer {
	bottom: "_plus11"
	top: "part_0_stage3_unit6_conv1"
	name: "part_0_stage3_unit6_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit6_conv1"
  top: "part_0_stage3_unit6_bn1"
  name: "part_0_stage3_unit6_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit6_bn1"
  top: "part_0_stage3_unit6_bn1"
  name: "part_0_stage3_unit6_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit6_bn1"
  top: "part_0_stage3_unit6_relu1"
  name: "part_0_stage3_unit6_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage3_unit6_relu1"
	top: "part_0_stage3_unit6_conv2"
	name: "part_0_stage3_unit6_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage3_unit6_conv2"
  top: "part_0_stage3_unit6_bn2"
  name: "part_0_stage3_unit6_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage3_unit6_bn2"
  top: "part_0_stage3_unit6_bn2"
  name: "part_0_stage3_unit6_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage3_unit6_bn2"
  top: "part_0_stage3_unit6_relu2"
  name: "part_0_stage3_unit6_relu2"
  type: "ReLU"
}

layer {
  name: "_plus12"
  type: "Eltwise"
  bottom: "part_0_stage3_unit6_relu2"
  bottom: "_plus11"
  top: "_plus12"
}

layer {
	bottom: "_plus12"
	top: "part_0_stage4_unit1_conv1"
	name: "part_0_stage4_unit1_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 2
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage4_unit1_conv1"
  top: "part_0_stage4_unit1_bn1"
  name: "part_0_stage4_unit1_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage4_unit1_bn1"
  top: "part_0_stage4_unit1_bn1"
  name: "part_0_stage4_unit1_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage4_unit1_bn1"
  top: "part_0_stage4_unit1_relu1"
  name: "part_0_stage4_unit1_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage4_unit1_relu1"
	top: "part_0_stage4_unit1_conv2"
	name: "part_0_stage4_unit1_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage4_unit1_conv2"
  top: "part_0_stage4_unit1_bn2"
  name: "part_0_stage4_unit1_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage4_unit1_bn2"
  top: "part_0_stage4_unit1_bn2"
  name: "part_0_stage4_unit1_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage4_unit1_bn2"
  top: "part_0_stage4_unit1_relu2"
  name: "part_0_stage4_unit1_relu2"
  type: "ReLU"
}

layer {
	bottom: "_plus12"
	top: "part_0_stage4_unit1_conv_proj"
	name: "part_0_stage4_unit1_conv_proj"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		stride: 2
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage4_unit1_conv_proj"
  top: "part_0_stage4_unit1_bn_proj"
  name: "part_0_stage4_unit1_bn_proj"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage4_unit1_bn_proj"
  top: "part_0_stage4_unit1_bn_proj"
  name: "part_0_stage4_unit1_bn_proj_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage4_unit1_bn_proj"
  top: "part_0_stage4_unit1_relu_proj"
  name: "part_0_stage4_unit1_relu_proj"
  type: "ReLU"
}

layer {
  name: "_plus13"
  type: "Eltwise"
  bottom: "part_0_stage4_unit1_relu2"
  bottom: "part_0_stage4_unit1_relu_proj"
  top: "_plus13"
}

layer {
	bottom: "_plus13"
	top: "part_0_stage4_unit2_conv1"
	name: "part_0_stage4_unit2_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage4_unit2_conv1"
  top: "part_0_stage4_unit2_bn1"
  name: "part_0_stage4_unit2_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage4_unit2_bn1"
  top: "part_0_stage4_unit2_bn1"
  name: "part_0_stage4_unit2_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage4_unit2_bn1"
  top: "part_0_stage4_unit2_relu1"
  name: "part_0_stage4_unit2_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage4_unit2_relu1"
	top: "part_0_stage4_unit2_conv2"
	name: "part_0_stage4_unit2_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage4_unit2_conv2"
  top: "part_0_stage4_unit2_bn2"
  name: "part_0_stage4_unit2_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage4_unit2_bn2"
  top: "part_0_stage4_unit2_bn2"
  name: "part_0_stage4_unit2_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage4_unit2_bn2"
  top: "part_0_stage4_unit2_relu2"
  name: "part_0_stage4_unit2_relu2"
  type: "ReLU"
}

layer {
  name: "_plus14"
  type: "Eltwise"
  bottom: "part_0_stage4_unit2_relu2"
  bottom: "_plus13"
  top: "_plus14"
}

layer {
	bottom: "_plus14"
	top: "part_0_stage4_unit3_conv1"
	name: "part_0_stage4_unit3_conv1"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage4_unit3_conv1"
  top: "part_0_stage4_unit3_bn1"
  name: "part_0_stage4_unit3_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage4_unit3_bn1"
  top: "part_0_stage4_unit3_bn1"
  name: "part_0_stage4_unit3_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage4_unit3_bn1"
  top: "part_0_stage4_unit3_relu1"
  name: "part_0_stage4_unit3_relu1"
  type: "ReLU"
}

layer {
	bottom: "part_0_stage4_unit3_relu1"
	top: "part_0_stage4_unit3_conv2"
	name: "part_0_stage4_unit3_conv2"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1
		bias_term: false
	}
}

layer {
  bottom: "part_0_stage4_unit3_conv2"
  top: "part_0_stage4_unit3_bn2"
  name: "part_0_stage4_unit3_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_stage4_unit3_bn2"
  top: "part_0_stage4_unit3_bn2"
  name: "part_0_stage4_unit3_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_stage4_unit3_bn2"
  top: "part_0_stage4_unit3_relu2"
  name: "part_0_stage4_unit3_relu2"
  type: "ReLU"
}

layer {
  name: "_plus15"
  type: "Eltwise"
  bottom: "part_0_stage4_unit3_relu2"
  bottom: "_plus14"
  top: "_plus15"
}

layer {
  bottom: "_plus15"
  top: "part_0_pool1"
  name: "part_0_pool1"
  type: "Pooling"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

layer {
  bottom: "part_0_pool1"
  top: "part_0_flat_pool"
  name: "part_0_flat_pool"
  type: "Flatten"
}

layer {
  bottom: "part_0_flat_pool"
  top: "part_0_bn_pool"
  name: "part_0_bn_pool"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 0.00002
  }
}
layer {
  bottom: "part_0_bn_pool"
  top: "part_0_bn_pool"
  name: "part_0_bn_pool_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "part_0_bn_pool"
  top: "part_0_flat"
  name: "part_0_flat"
  type: "InnerProduct"
  inner_product_param {
    num_output: 512
  }
}

