{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_conv0", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_bn0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_bn0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_bn0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_bn0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_bn0", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_relu0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage1_unit1_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage1_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage1_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage1_unit1_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage1_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage1_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_conv_proj_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage1_unit1_conv_proj", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[9, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn_proj_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn_proj_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn_proj_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit1_bn_proj_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage1_unit1_bn_proj", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage1_unit1_relu_proj", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[25, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage1_unit2_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage1_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage1_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage1_unit2_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage1_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage1_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[50, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit3_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage1_unit3_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit3_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit3_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage1_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage1_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit3_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage1_unit3_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit3_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit3_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage1_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage1_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage1_unit3_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[67, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage2_unit1_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "256"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage2_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage2_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage2_unit1_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage2_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage2_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_conv_proj_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage2_unit1_conv_proj", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "256"
      }, 
      "inputs": [[68, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn_proj_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn_proj_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn_proj_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit1_bn_proj_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage2_unit1_bn_proj", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage2_unit1_relu_proj", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[84, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage2_unit2_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage2_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage2_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage2_unit2_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage2_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage2_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[109, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit3_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage2_unit3_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit3_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit3_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage2_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage2_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit3_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage2_unit3_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit3_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit3_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage2_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage2_unit3_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[126, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit4_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage2_unit4_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit4_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit4_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit4_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit4_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage2_unit4_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0], [131, 0, 0], [132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage2_unit4_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit4_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage2_unit4_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit4_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit4_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit4_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage2_unit4_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage2_unit4_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage2_unit4_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[143, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage3_unit1_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "256"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage3_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0], [148, 0, 0], [149, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage3_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage3_unit1_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage3_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0], [157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage3_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_conv_proj_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage3_unit1_conv_proj", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "256"
      }, 
      "inputs": [[144, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn_proj_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn_proj_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn_proj_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit1_bn_proj_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage3_unit1_bn_proj", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[162, 0, 0], [163, 0, 0], [164, 0, 0], [165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage3_unit1_relu_proj", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[160, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage3_unit2_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage3_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[171, 0, 0], [172, 0, 0], [173, 0, 0], [174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage3_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage3_unit2_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[177, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage3_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[179, 0, 0], [180, 0, 0], [181, 0, 0], [182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage3_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[185, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit3_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage3_unit3_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit3_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit3_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage3_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[188, 0, 0], [189, 0, 0], [190, 0, 0], [191, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage3_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit3_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage3_unit3_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[194, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit3_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit3_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage3_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[196, 0, 0], [197, 0, 0], [198, 0, 0], [199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage3_unit3_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[202, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit4_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage3_unit4_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[203, 0, 0], [204, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit4_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit4_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit4_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit4_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage3_unit4_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[205, 0, 0], [206, 0, 0], [207, 0, 0], [208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage3_unit4_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit4_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage3_unit4_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit4_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit4_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit4_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit4_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage3_unit4_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": [[213, 0, 0], [214, 0, 0], [215, 0, 0], [216, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part_0_stage3_unit4_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[219, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit5_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_0_stage3_unit5_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "256"
      }, 
      "inputs": [[220, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit5_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit5_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit5_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_0_stage3_unit5_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_0_stage3_unit5_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
